{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-09-01T08:15:35.5950525Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-09-01T08:15:35.5950525Z","name":"Baseline - Enable Windows Backup","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"fbab0f63-9022-433d-b895-0a98bf72ed07","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_settingssync_enablewindowsbackup","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_settingssync_enablewindowsbackup_1","children":[]}}}]}