{
    "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
    "displayName": "Android-Compliance-FullyManaged-Strict",
    "description": "Android Compliance Policy for Fully Managed Devices (strict settings)",
    "roleScopeTagIds": [
        "0"
    ],
    "advancedThreatProtectionRequiredSecurityLevel": "secured",
    "deviceThreatProtectionEnabled": true,
    "deviceThreatProtectionRequiredSecurityLevel": "secured",
    "localActions": [],
    "osMaximumVersion": "13.1",
    "osMinimumVersion": "8.1",
    "passwordExpirationDays": 365,
    "passwordMinimumLength": 8,
    "passwordMinimumLetterCharacters": 8,
    "passwordMinimumLowerCaseCharacters": 1,
    "passwordMinimumNonLetterCharacters": 1,
    "passwordMinimumNumericCharacters": 1,
    "passwordMinimumSymbolCharacters": 1,
    "passwordMinimumUpperCaseCharacters": 1,
    "passwordMinutesOfInactivityBeforeLock": 5,
    "passwordPreviousPasswordCountToBlock": 24,
    "passwordRequired": true,
    "passwordRequiredType": "alphanumericWithSymbols",
    "scheduledActionsForRule": [
        {
            "ruleName": "PasswordRequired",
            "scheduledActionConfigurations": [
                {
                    "actionType": "block",
                    "gracePeriodHours": 0,
                    "notificationMessageCCList": [],
                    "notificationTemplateId": ""
                },
                {
                    "actionType": "notification",
                    "gracePeriodHours": 120,
                    "notificationMessageCCList": [],
                    "notificationTemplateId": "6790e94e-ccb9-4936-bbcc-017958b54210"
                },
                {
                    "actionType": "pushNotification",
                    "gracePeriodHours": 120,
                    "notificationMessageCCList": [],
                    "notificationTemplateId": ""
                },
                {
                    "actionType": "remoteLock",
                    "gracePeriodHours": 240,
                    "notificationMessageCCList": [],
                    "notificationTemplateId": ""
                },
                {
                    "actionType": "retire",
                    "gracePeriodHours": 2160,
                    "notificationMessageCCList": [],
                    "notificationTemplateId": ""
                }
            ]
        }
    ],
    "securityRequireIntuneAppIntegrity": true,
    "securityRequireSafetyNetAttestationBasicIntegrity": true,
    "securityRequireSafetyNetAttestationCertifiedDevice": true,
    "storageRequireEncryption": true
}
