{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-09-01T08:07:41.1190826Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-09-01T08:07:41.1190826Z","name":"Baseline - Edge - Allow pages to use the built-in AI APIs","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"ee92773f-06a6-4d6f-b26c-356b1c9d89cb","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_builtinaiapisenabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_microsoft_edgev138~policy~microsoft_edge_builtinaiapisenabled_1","children":[]}}}]}