{
  "@odata.type": "#microsoft.graph.androidCompliancePolicy",
  "displayName": "Android - Baseline Compliance Policy",
  "description": "Baseline compliance requirements for Android devices",
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": ""
        }
      ]
    }
  ],
  "passwordRequired": true,
  "passwordMinimumLength": 6,
  "passwordRequiredType": "deviceDefault",
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordExpirationDays": null,
  "passwordPreviousPasswordBlockCount": null,
  "securityPreventInstallAppsFromUnknownSources": true,
  "securityDisableUsbDebugging": true,
  "securityRequireVerifyApps": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": "9.0",
  "osMaximumVersion": null,
  "storageRequireEncryption": true
}
