{"sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"agentIdRiskLevels":null,"insiderRiskLevels":null,"clients":null,"platforms":null,"locations":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"authenticationFlows":null,"applications":{"includeApplications":["797f4846-ba00-4fd7-ba43-dac1f8f63013"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[],"applicationFilter":null,"networkAccess":null,"globalSecureAccess":null},"users":{"includeUsers":["All"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#conditionalAccess/templates('d8c51a9a-e6b1-454d-86af-554e7872e2c1')/details/grantControls/authenticationStrength/$entity","authenticationStrength":null},"displayName":"Require multifactor authentication for Azure management"}