{
  "sessionControls": {
    "continuousAccessEvaluation": null,
    "disableResilienceDefaults": null,
    "signInFrequency": {
      "isEnabled": true,
      "type": null,
      "authenticationType": "primaryAndSecondaryAuthentication",
      "frequencyInterval": "everyTime",
      "value": null
    },
    "networkAccessSecurity": null,
    "persistentBrowser": null,
    "secureSignInSession": null,
    "cloudAppSecurity": null,
    "applicationEnforcedRestrictions": null,
    "globalSecureAccessFilteringProfile": null
  },
  "conditions": {
    "locations": null,
    "signInRiskLevels": [
      "high",
      "medium"
    ],
    "times": null,
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "excludeApplications": [],
      "includeUserActions": [],
      "networkAccess": null,
      "globalSecureAccess": null,
      "includeApplications": [
        "All"
      ],
      "applicationFilter": null,
      "includeAuthenticationContextClassReferences": []
    },
    "authenticationFlows": null,
    "userRiskLevels": [],
    "platforms": null,
    "insiderRiskLevels": null,
    "deviceStates": null,
    "clients": null,
    "agentIdRiskLevels": null,
    "users": {
      "excludeUsers": [],
      "includeUsers": [
        "All"
      ],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGroups": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGroups": [],
      "excludeRoles": []
    },
    "devices": null
  },
  "grantControls": {
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#conditionalAccess/templates('6b619f55-792e-45dc-9711-d83ec9d7ae90')/details/grantControls/authenticationStrength/$entity",
    "authenticationStrength": null,
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR"
  }
}