{"sessionControls":null,"conditions":{"userRiskLevels":[],"signInRiskLevels":[],"clientAppTypes":["all"],"servicePrincipalRiskLevels":[],"agentIdRiskLevels":null,"insiderRiskLevels":null,"clients":null,"platforms":null,"times":null,"deviceStates":null,"devices":null,"clientApplications":null,"authenticationFlows":null,"applications":{"includeApplications":[],"excludeApplications":[],"includeUserActions":["urn:user:registersecurityinfo"],"includeAuthenticationContextClassReferences":[],"applicationFilter":null,"networkAccess":null,"globalSecureAccess":null},"users":{"includeUsers":["All"],"excludeUsers":["GuestsOrExternalUsers"],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":["62e90394-69f5-4237-9190-012177145e10"],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"locations":{"includeLocations":["All"],"excludeLocations":["AllTrusted"]}},"grantControls":{"operator":"OR","builtInControls":["mfa"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength@odata.context":"https://graph.microsoft.com/beta/$metadata#conditionalAccess/templates('b8bda7f8-6584-4446-bce9-d871480e53fa')/details/grantControls/authenticationStrength/$entity","authenticationStrength":null},"displayName":"Securing security info registration"}