{
    "@odata.type": "#microsoft.graph.depMacOSEnrollmentProfile",
    "displayName": "macOS Enrollment",
    "description": "Corporate Managed macOS Devices",
    "accessibilityScreenDisabled": true,
    "adminAccountFullName": "",
    "adminAccountUserName": "",
    "appleIdDisabled": true,
    "applePayDisabled": true,
    "autoUnlockWithWatchDisabled": true,
    "chooseYourLockScreenDisabled": true,
    "configurationEndpointUrl": "",
    "configurationWebUrl": true,
    "diagnosticsDisabled": true,
    "displayToneSetupDisabled": true,
    "dontAutoPopulatePrimaryAccountInfo": true,
    "enableAuthenticationViaCompanyPortal": false,
    "enabledSkipKeys": [
        "Location",
        "TOS",
        "Biometric",
        "Payment",
        "Siri",
        "Privacy",
        "AppleID",
        "DisplayTone",
        "ScreenTime",
        "Diagnostics",
        "Restore",
        "TermsOfAddress",
        "Registration",
        "FileVault",
        "iCloudDiagnostics",
        "iCloudStorage",
        "Appearance",
        "Accessibility",
        "UnlockWithWatch"
    ],
    "enableRestrictEditing": false,
    "fileVaultDisabled": true,
    "hideAdminAccount": false,
    "iCloudDiagnosticsDisabled": true,
    "iCloudStorageDisabled": true,
    "isMandatory": true,
    "locationDisabled": true,
    "primaryAccountFullName": "",
    "primaryAccountUserName": "",
    "privacyPaneDisabled": true,
    "profileRemovalDisabled": true,
    "registrationDisabled": true,
    "requireCompanyPortalOnSetupAssistantEnrolledDevices": false,
    "requiresUserAuthentication": true,
    "restoreBlocked": true,
    "screenTimeScreenDisabled": true,
    "setPrimarySetupAccountAsRegularUser": false,
    "siriDisabled": true,
    "skipPrimarySetupAccountCreation": true,
    "supervisedModeEnabled": true,
    "supportDepartment": "IT Dept",
    "supportPhoneNumber": "12345",
    "termsAndConditionsDisabled": true,
    "touchIdDisabled": true
}
