{
    "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "displayName": "Default Autopilot Deployment Profile",
    "description": "User Driven Azure AD Join with Standard User",
    "deviceType": "windowsPc",
    "deviceNameTemplate": "%SERIAL%",
    "language": "en-US",
    "enableWhiteGlove": true,
    "extractHardwareHash": true,
    "hybridAzureADJoinSkipConnectivityCheck": false,
    "outOfBoxExperienceSettings": {
        "hidePrivacySettings": true,
        "hideEULA": true,
        "userType": "standard",
        "deviceUsageType": "singleUser",
        "skipKeyboardSelectionPage": true,
        "hideEscapeLink": true
    },
    "roleScopeTagIds": []
}
