{
    "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "displayName": "Self Deploy Default Autopilot Deployment Profile",
    "description": "Self Deploy Azure AD Join with Standard User",
    "deviceNameTemplate": "%SERIAL%",
    "locale": "os-default",
    "preprovisioningAllowed": false,
    "deviceType": "windowsPc",
    "hardwareHashExtractionEnabled": true,
    "roleScopeTagIds": [],
    "hybridAzureADJoinSkipConnectivityCheck": false,
    "outOfBoxExperienceSetting": {
        "deviceUsageType": "shared",
        "escapeLinkHidden": true,
        "privacySettingsHidden": true,
        "eulaHidden": true,
        "userType": "standard",
        "keyboardSelectionPageSkipped": true
    }
}