{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')",
  "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2026-03-05T10:54:42.406279Z",
  "creationSource": null,
  "description": "OIBID:D239DFC3-E20A-48C9-A906-09C0AF624CB7",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2026-04-09T09:51:39.1920395Z",
  "name": "Win - OIB - SC - Microsoft Store - D - Configuration - v3.8",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 7,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm",
  "id": "04131e17-b62f-40c6-8aef-6a88931485c8",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/assignments",
  "assignments": [],
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowalltrustedapps",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_allowalltrustedapps_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowappstoreautoupdate",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_allowappstoreautoupdate_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_allowdeveloperunlock_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowgamedvr",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_allowgamedvr_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_blocknonadminuserinstall",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_blocknonadminuserinstall_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_msiallowusercontroloverinstall",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_msiallowusercontroloverinstall_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges_0",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/settings('6')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('04131e17-b62f-40c6-8aef-6a88931485c8')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}