{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')",
  "@odata.editLink": "deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2026-04-16T11:15:29.3323481Z",
  "creationSource": null,
  "description": "OIBID:445BF199-4BB1-49B3-AB70-FFE4B243AEDC",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2026-04-16T11:15:29.3323481Z",
  "name": "Win - OIB - SC - Windows User Experience - D - Automatic Restart Sign-On - v3.8",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm",
  "id": "dfd04d0a-dec4-46d0-919d-41d7bf4be248",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/assignments",
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_windowslogon_configautomaticrestartsignon_configautomaticrestartsignondescription_0",
                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                "children": []
              }
            }
          ]
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_windowslogon_allowautomaticrestartsignon",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_windowslogon_allowautomaticrestartsignon_1",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/settings('1')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('dfd04d0a-dec4-46d0-919d-41d7bf4be248')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}